<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of VoiceInk and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.ScruffyInLondon.munki.VoiceInk</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VoiceInk</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/VoiceInk</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>VoiceInk is a voice-to-text app for macOS to transcribe what you say to text almost instantly.</string>
            <key>display_name</key>
            <string>VoiceInk</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4</string>
    <key>ParentRecipe</key>
    <string>com.github.ScruffyInLondon.pkg.VoiceInk</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installs</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>/Applications/VoiceInk.app</string>
                            <key>type</key>
                            <string>application</string>
                            <key>CFBundleShortVersionString</key>
                            <string>%version%</string>
                        </dict>
                    </array>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>