<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of VoiceInk.</string>
        <key>Identifier</key>
        <string>com.github.ScruffyInLondon.download.VoiceInk</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>VoiceInk</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>github_repo</key>
                    <string>Beingpax/VoiceInk</string>
                    <key>asset_regex</key>
                    <string>VoiceInk.dmg</string>
                </dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/VoiceInk.app</string>
                    <key>requirement</key>
                    <string>anchor apple generic and identifier "com.prakashjoshipax.VoiceInk" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = V6J6A3VWY2)</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>