<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages the VoiceInk Download.</string>
    <key>Identifier</key>
    <string>com.github.ScruffyInLondon.pkg.VoiceInk</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>1.4</string>
    <key>ParentRecipe</key>
    <string>com.github.ScruffyInLondon.download.VoiceInk</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>